In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [2]:
df_april=pd.read_csv('Datasets/uber-raw-data-apr14.csv')
df_april.head()

          Date/Time      Lat      Lon    Base
0  04-01-2014 00:11  40.7690 -73.9549  B02512
1  04-01-2014 00:17  40.7267 -74.0345  B02512
2  04-01-2014 00:21  40.7316 -73.9873  B02512
3  04-01-2014 00:28  40.7588 -73.9776  B02512
4  04-01-2014 00:33  40.7594 -73.9722  B02512

In [3]:
df_may=pd.read_csv('Datasets/uber-raw-data-may14.csv')
df_may.head()

          Date/Time      Lat      Lon    Base
0  5/1/2014 0:02:00  40.7521 -73.9914  B02512
1  5/1/2014 0:06:00  40.6965 -73.9715  B02512
2  5/1/2014 0:15:00  40.7464 -73.9838  B02512
3  5/1/2014 0:17:00  40.7463 -74.0011  B02512
4  5/1/2014 0:17:00  40.7594 -73.9734  B02512

In [4]:
df_june=pd.read_csv('Datasets/uber-raw-data-jun14.csv')
df_june.head()

          Date/Time      Lat      Lon    Base
0  6/1/2014 0:00:00  40.7293 -73.9920  B02512
1  6/1/2014 0:01:00  40.7131 -74.0097  B02512
2  6/1/2014 0:04:00  40.3461 -74.6610  B02512
3  6/1/2014 0:04:00  40.7555 -73.9833  B02512
4  6/1/2014 0:07:00  40.6880 -74.1831  B02512

In [5]:
df_july=pd.read_csv('Datasets/uber-raw-data-jul14.csv')
df_july.head()

          Date/Time      Lat      Lon    Base
0  7/1/2014 0:03:00  40.7586 -73.9706  B02512
1  7/1/2014 0:05:00  40.7605 -73.9994  B02512
2  7/1/2014 0:06:00  40.7320 -73.9999  B02512
3  7/1/2014 0:09:00  40.7635 -73.9793  B02512
4  7/1/2014 0:20:00  40.7204 -74.0047  B02512

In [6]:
df_aug=pd.read_csv('Datasets/uber-raw-data-aug14.csv')
df_aug.head()

          Date/Time      Lat      Lon    Base
0  8/1/2014 0:03:00  40.7366 -73.9906  B02512
1  8/1/2014 0:09:00  40.7260 -73.9918  B02512
2  8/1/2014 0:12:00  40.7209 -74.0507  B02512
3  8/1/2014 0:12:00  40.7387 -73.9856  B02512
4  8/1/2014 0:12:00  40.7323 -74.0077  B02512

In [7]:
df_sep=pd.read_csv('Datasets/uber-raw-data-sep14.csv')
df_sep.head()

          Date/Time      Lat      Lon    Base
0  9/1/2014 0:01:00  40.2201 -74.0021  B02512
1  9/1/2014 0:01:00  40.7500 -74.0027  B02512
2  9/1/2014 0:03:00  40.7559 -73.9864  B02512
3  9/1/2014 0:06:00  40.7450 -73.9889  B02512
4  9/1/2014 0:11:00  40.8145 -73.9444  B02512

## 1. Number of rides as per the day.

In [8]:
def rides_per_day(df):
    df['Date/Time']=pd.to_datetime(df['Date/Time'])
    df['Date']=df['Date/Time'].apply(lambda time:time.strftime("%d-%m-%Y"))
    return df['Date'].sort_values().value_counts()

### For April Month

In [9]:
rides_per_day(df_april)

30-04-2014    36251
04-04-2014    26714
25-04-2014    25095
26-04-2014    24925
24-04-2014    23352
29-04-2014    22835
17-04-2014    20973
03-04-2014    20701
15-04-2014    20641
11-04-2014    20420
23-04-2014    20346
10-04-2014    20041
07-04-2014    19550
05-04-2014    19521
12-04-2014    18170
18-04-2014    18074
16-04-2014    17717
02-04-2014    17474
22-04-2014    16975
09-04-2014    16843
08-04-2014    16188
28-04-2014    15475
27-04-2014    14677
19-04-2014    14602
01-04-2014    14546
06-04-2014    13445
21-04-2014    13162
14-04-2014    12674
13-04-2014    12112
20-04-2014    11017
Name: Date, dtype: int64

### For May Month

In [10]:
rides_per_day(df_may)

16-05-2014    32493
08-05-2014    27513
22-05-2014    26802
23-05-2014    26465
09-05-2014    26385
15-05-2014    26301
29-05-2014    24930
30-05-2014    24413
02-05-2014    24235
21-05-2014    23508
01-05-2014    23375
10-05-2014    22550
17-05-2014    22294
28-05-2014    22240
03-05-2014    22234
14-05-2014    22218
07-05-2014    21891
31-05-2014    21261
20-05-2014    20860
13-05-2014    19498
06-05-2014    19300
19-05-2014    18315
05-05-2014    17859
12-05-2014    17470
27-05-2014    17004
18-05-2014    16508
11-05-2014    14901
24-05-2014    14651
04-05-2014    13918
25-05-2014    10841
26-05-2014    10202
Name: Date, dtype: int64

### For June Month

In [11]:
rides_per_day(df_june)

13-06-2014    31207
12-06-2014    29844
19-06-2014    28594
26-06-2014    28516
05-06-2014    28371
25-06-2014    26460
11-06-2014    25716
27-06-2014    24895
06-06-2014    24683
18-06-2014    24647
20-06-2014    24271
09-06-2014    23244
10-06-2014    22874
04-06-2014    22831
03-06-2014    22674
17-06-2014    21807
28-06-2014    21208
07-06-2014    20889
24-06-2014    20779
21-06-2014    19940
14-06-2014    19327
30-06-2014    18395
16-06-2014    17778
23-06-2014    17735
02-06-2014    17503
29-06-2014    17107
22-06-2014    16322
01-06-2014    15967
08-06-2014    15749
15-06-2014    14511
Name: Date, dtype: int64

### For July Month

In [12]:
rides_per_day(df_july)

23-07-2014    34073
15-07-2014    33845
31-07-2014    33541
24-07-2014    32050
30-07-2014    30740
17-07-2014    30710
10-07-2014    30541
25-07-2014    29975
18-07-2014    29860
22-07-2014    29029
11-07-2014    28752
16-07-2014    28607
09-07-2014    27817
26-07-2014    27708
29-07-2014    27589
14-07-2014    27350
02-07-2014    26480
12-07-2014    25936
08-07-2014    25763
19-07-2014    25726
28-07-2014    23981
21-07-2014    23578
27-07-2014    22590
03-07-2014    21597
01-07-2014    21228
20-07-2014    21212
13-07-2014    21082
07-07-2014    18280
04-07-2014    14148
06-07-2014    11443
05-07-2014    10890
Name: Date, dtype: int64

### For August Month

In [13]:
rides_per_day(df_aug)

07-08-2014    32759
01-08-2014    32353
21-08-2014    32304
06-08-2014    30495
14-08-2014    30457
08-08-2014    30411
13-08-2014    29788
12-08-2014    29646
22-08-2014    29512
15-08-2014    28974
02-08-2014    28678
28-08-2014    28597
05-08-2014    28094
20-08-2014    27955
29-08-2014    27424
23-08-2014    27097
27-08-2014    27018
09-08-2014    26286
16-08-2014    26234
04-08-2014    24952
19-08-2014    24834
26-08-2014    24550
30-08-2014    23930
31-08-2014    23271
03-08-2014    23146
11-08-2014    22632
25-08-2014    22093
24-08-2014    22036
18-08-2014    21956
17-08-2014    21209
10-08-2014    20584
Name: Date, dtype: int64

### For September Month

In [14]:
rides_per_day(df_sep)

13-09-2014    43205
05-09-2014    42319
19-09-2014    41017
06-09-2014    40520
18-09-2014    40274
12-09-2014    39540
27-09-2014    39468
20-09-2014    38864
04-09-2014    38360
25-09-2014    38203
26-09-2014    37504
11-09-2014    36439
16-09-2014    36092
10-09-2014    35910
17-09-2014    35531
09-09-2014    34560
30-09-2014    33431
03-09-2014    32631
24-09-2014    31301
08-09-2014    30360
23-09-2014    30316
07-09-2014    30134
28-09-2014    29656
15-09-2014    29454
29-09-2014    29201
02-09-2014    28831
21-09-2014    28620
22-09-2014    28312
14-09-2014    28122
01-09-2014    19961
Name: Date, dtype: int64

## 2. Number of rides per a base.

In [15]:
df_april['Base'].sort_values().value_counts()

B02682    227808
B02598    183263
B02617    108001
B02512     35536
B02764      9908
Name: Base, dtype: int64

In [16]:
df_may['Base'].sort_values().value_counts()

B02598    260549
B02682    222883
B02617    122734
B02512     36765
B02764      9504
Name: Base, dtype: int64

In [17]:
df_june['Base'].sort_values().value_counts()

B02598    242975
B02682    194926
B02617    184460
B02512     32509
B02764      8974
Name: Base, dtype: int64

In [18]:
df_july['Base'].sort_values().value_counts()

B02617    310160
B02598    245597
B02682    196754
B02512     35021
B02764      8589
Name: Base, dtype: int64

In [19]:
df_aug['Base'].sort_values().value_counts()

B02617    355803
B02598    220129
B02682    173280
B02764     48591
B02512     31472
Name: Base, dtype: int64

In [20]:
df_sep['Base'].sort_values().value_counts()

B02617    377695
B02598    240600
B02682    197138
B02764    178333
B02512     34370
Name: Base, dtype: int64

## 3. Total number of rides from April to September.

In [23]:
def all_info(df):
    print(df.shape)
    df.info()

In [24]:
all_info(df_april)

(564516, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  datetime64[ns]
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  object
 4   Date       564516 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 21.5+ MB

In [25]:
all_info(df_may)

(652435, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652435 entries, 0 to 652434
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  652435 non-null  datetime64[ns]
 1   Lat        652435 non-null  float64
 2   Lon        652435 non-null  float64
 3   Base       652435 non-null  object
 4   Date       652435 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 24.9+ MB

In [26]:
all_info(df_june)

(663844, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 663844 entries, 0 to 663843
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  663844 non-null  datetime64[ns]
 1   Lat        663844 non-null  float64
 2   Lon        663844 non-null  float64
 3   Base       663844 non-null  object
 4   Date       663844 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 25.3+ MB

In [27]:
all_info(df_july)

(796121, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 796121 entries, 0 to 796120
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  796121 non-null  datetime64[ns]
 1   Lat        796121 non-null  float64
 2   Lon        796121 non-null  float64
 3   Base       796121 non-null  object
 4   Date       796121 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 30.4+ MB

In [28]:
all_info(df_aug)

(829275, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 829275 entries, 0 to 829274
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  829275 non-null  datetime64[ns]
 1   Lat        829275 non-null  float64
 2   Lon        829275 non-null  float64
 3   Base       829275 non-null  object
 4   Date       829275 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 31.6+ MB

In [29]:
all_info(df_sep)

(1028136, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028136 entries, 0 to 1028135
Data columns (total 5 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   Date/Time  1028136 non-null  datetime64[ns]
 1   Lat        1028136 non-null  float64
 2   Lon        1028136 non-null  float64
 3   Base       1028136 non-null  object
 4   Date       1028136 non-null  object
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 39.2+ MB

In [42]:
df1=df_april.merge(df_may,how='outer')

In [45]:
df1=df1.merge(df_june,how='outer')

In [46]:
df1=df1.merge(df_july,how='outer')

In [47]:
df1=df1.merge(df_aug,how='outer')

In [48]:
df1=df1.merge(df_sep,how='outer')

In [50]:
df1.shape

(4534327, 5)

In [52]:
print('Total number of uber rides from april to september: ',len(df1))

Total number of uber rides from april to september:  4534327

## 4. Number of rides per hours.

In [54]:
df1['Hours']=df1['Date/Time'].apply(lambda date:date.hour)
df1['Hours'].sort_index().value_counts()

17    336190
18    324679
16    313400
19    294513
20    284604
21    281460
15    275466
22    241858
14    230625
13    195877
7     193094
8     190504
12    170452
23    169190
11    165703
9     159967
10    159148
6     143213
0     103836
5      83939
1      67227
4      55230
3      48287
2      45865
Name: Hours, dtype: int64

## 5. Highest number of rides for Base.

In [58]:
print('Base with highest number of rides:',df1['Base'].max(),'--',df1['Base'].value_counts().max())

Base with highest number of rides: B02764 -- 1458853